In [1]:
# antes de empezar importamos la librería de NumPy para poder trabajar con todos sus métodos. 
import numpy as np

# importamos la pandas para poder trabajar en la lección
import pandas as pd

C:\Users\karin\AppData\Local\Temp\ipykernel_12032\437814846.py:5: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# Pair programming Intro a Pandas

El objetivo de la clase de hoy será crear unos cuántos DataFrames y Series a través de los siguientes ejercicios:

1. ¿Qué diferencia hay entre una Serie y un DataFrame?

1. `Series`: Representa una estructura de datos unidimensional similar a un array o una columna en una tabla. Cada elemento en una Serie tiene un índice asociado que permite acceder a los datos de forma individual.

2. `DataFrame`: Representa una estructura de datos bidimensional similar a una tabla de una base de datos o una hoja de cálculo de Excel. Consiste en una colección de Series organizadas en columnas. Los DataFrames son especialmente útiles para el análisis de datos tabulares y ofrecen una gran cantidad de funcionalidades para manipular y analizar los datos.


2. Momento de trabajar con Series. Contesta a las siguientes preguntas:

- Crea dos listas:

    - Una que se llame "valores" que tenga 7 números aleatorios.

    - Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

- A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

- A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.

- Crea una Serie con el diccionario creado en el punto anterior.

- ¿Qué forma tiene esta última Serie?

- ¿Qué tipo de datos tiene?

- ¿Qué tamaño tiene?

- ¿Cuáles son los índices de la Serie?

- ¿Y los values?

- Extrae el valor para el índice "lunes"

- Extrae el valor para el índice "lunes", "martes" y "miércoles".

- Extrae el valor para el índice "lunes" y "domingo".

In [2]:
valores = [7,5,9,3,2,8,1]
indices = ["lunes","martes","miercoles","jueves","viernes","sabado","domingo"]

In [3]:
serie_listas = pd.Series(valores,index= indices)
serie_listas

lunes        7
martes       5
miercoles    9
jueves       3
viernes      2
sabado       8
domingo      1
dtype: int64

In [4]:
resultado = zip(indices, valores)
print(list(resultado))

[('lunes', 7), ('martes', 5), ('miercoles', 9), ('jueves', 3), ('viernes', 2), ('sabado', 8), ('domingo', 1)]

In [5]:
dicc= {}

for clave, valor in zip(indices, valores):
    dicc[clave] = valor

print(dicc)

{'lunes': 7, 'martes': 5, 'miercoles': 9, 'jueves': 3, 'viernes': 2, 'sabado': 8, 'domingo': 1}

In [6]:
Series_diccionario = pd.Series(dicc)
Series_diccionario

lunes        7
martes       5
miercoles    9
jueves       3
viernes      2
sabado       8
domingo      1
dtype: int64

In [7]:
# tiene forma de object
type(Series_diccionario)

display("La serie con la que vamos a trabajar es:", Series_diccionario)
print("---------------------------")
# utilizamos el método index que nos va a devolver todos los índices 
# fijaos como en este caso nos ha devuelto todos los índices de nuestra Serie, es decir, los nombres de las alumnas
print(f"El método 'index' nos devuelve los índices de la Serie: {Series_diccionario.index}")
print("---------------------------")
# ahora utilizamos el método 'values' nos devuelve todos los valores de la Serie
# en este caso los números que teníamos
print(f"El método 'values' nos devuelve los valores de la Serie: {Series_diccionario.values}")
print("---------------------------")

'La serie con la que vamos a trabajar es:'

lunes        7
martes       5
miercoles    9
jueves       3
viernes      2
sabado       8
domingo      1
dtype: int64

---------------------------
El método 'index' nos devuelve los índices de la Serie: Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')
---------------------------
El método 'values' nos devuelve los valores de la Serie: [7 5 9 3 2 8 1]
---------------------------

In [8]:
#utilizando el método 'shape' nos devuelve el número de "filas" que tenemos en la Serie
print(f"El método 'shape' nos devuelve la forma de la Serie: {Series_diccionario.shape}")
print("---------------------------")
#utilizando el método 'size' nos devuelve el número de elementos que tenemos en la Serie
print(f"El método 'size' nos devuelve el número de elementos de la Serie: {Series_diccionario.size}")
print("---------------------------")
#utilizando el método 'dtypes' nos devuelve el tipo de datos de la Serie
print(f"El método 'dtypes' nos devuelve el tipo de datos de la Serie: {Series_diccionario.dtypes}")

El método 'shape' nos devuelve la forma de la Serie: (7,)
---------------------------
El método 'size' nos devuelve el número de elementos de la Serie: 7
---------------------------
El método 'dtypes' nos devuelve el tipo de datos de la Serie: int64

In [9]:
print(Series_diccionario)

print("---------------------------")

#Extraemos el valor para el indice lunes
Series_diccionario[0]

lunes        7
martes       5
miercoles    9
jueves       3
viernes      2
sabado       8
domingo      1
dtype: int64
---------------------------

C:\Users\karin\AppData\Local\Temp\ipykernel_12032\3979878596.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Series_diccionario[0]

7

In [10]:
#Extraemos valores para los índices lunes, martes y miércoles
Series_diccionario[0:3]

lunes        7
martes       5
miercoles    9
dtype: int64

In [11]:
#Extraemos valores para los índices lunes y domingo
Series_diccionario[[0,6]]

C:\Users\karin\AppData\Local\Temp\ipykernel_12032\986408824.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Series_diccionario[[0,6]]

lunes      7
domingo    1
dtype: int64


3. Es el turno de los DataFrames

- Crea un array de dos dimensiones con 4 filas y 3 columnas.

- Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

- Descarga el archivo "medallas" y carga el DataFrame.

- Usando el loc extrae todas las columnas de la fila de Tailandia.

- Usando el loc extrae todas las columnas de China e Irán.

- Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

- Usando el iloc extrae la información de la India. Devolved todas las columnas.

- Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

- Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [12]:
# Creamos un array de dos dimensiones (4,3)
array= np.random.rand(4,3)
array

array([[0.6719586 , 0.27046018, 0.31890022],
       [0.85773813, 0.72639387, 0.75068716],
       [0.15630539, 0.2740111 , 0.65135421],
       [0.61035254, 0.84093523, 0.82985103]])

In [13]:
# Convertimos el array en Dataframe con nombres a sus columnas 
df_array = pd.DataFrame(array, columns=("España","Francia","italia"))
df_array

     España   Francia    italia
0  0.671959  0.270460  0.318900
1  0.857738  0.726394  0.750687
2  0.156305  0.274011  0.651354
3  0.610353  0.840935  0.829851

In [14]:
# Accedemos al dataframe MEDALLAS con su ruta correspondiente y eliminamos su índice para facilitar su visualización:
df_medallas = pd.read_csv("./medallas.csv")

In [15]:
# Printeamos dataframe
df_medallas

   Unnamed: 0             País   Oro  Plata  Bronce
0           1            China  1473    994     720
1           2            Japón  1032   1037     985
2           3    Corea del Sur   745    663     827
3           4             Irán   179    181     197
4           5       Kazajistán   155    158     224
5           6            India   154    202     315
6           7        Tailandia   132    175     278
7           8        Indonesia   112    131     240
8           9     China Taipéi    99    144     276
9          10  Corea del Norte    91    120     235

In [16]:
# Printeamos las columnas del dataframe
df_medallas.columns

Index(['Unnamed: 0', 'País', 'Oro', 'Plata', 'Bronce'], dtype='object')

In [17]:
# Accedemos con loc a la fila Tailandia de la columna País: 
df_medallas.loc[df_medallas['País'] == 'Tailandia']

   Unnamed: 0       País  Oro  Plata  Bronce
6           7  Tailandia  132    175     278

In [18]:
# Extraemos filas de China e Irán 
df_medallas.loc[[0,3], :]

   Unnamed: 0   País   Oro  Plata  Bronce
0           1  China  1473    994     720
3           4   Irán   179    181     197

In [19]:
# Extraemos de China e Irán las columnas Oro, plata y bronce
df_medallas.loc[[0,3], "Oro":"Bronce"]

    Oro  Plata  Bronce
0  1473    994     720
3   179    181     197

In [20]:
# Extraemos la fila India, todas sus columnas
df_medallas.iloc[5,:]

Unnamed: 0        6
País          India
Oro             154
Plata           202
Bronce          315
Name: 5, dtype: object

In [21]:
# Extraemos las filas de todos los países en posición impar con todas sus columnas
fila_impar = df_medallas.iloc[1:10:2]
fila_impar

   Unnamed: 0             País   Oro  Plata  Bronce
1           2            Japón  1032   1037     985
3           4             Irán   179    181     197
5           6            India   154    202     315
7           8        Indonesia   112    131     240
9          10  Corea del Norte    91    120     235

In [22]:
# Extraemos las filas de todos los países en posición impar con todas sus columnas y solo las columnas oro, plata y bronce
fila_impar = df_medallas.iloc[1:10:2, 2:5]
fila_impar

    Oro  Plata  Bronce
1  1032   1037     985
3   179    181     197
5   154    202     315
7   112    131     240
9    91    120     235


- Contesta a las siguientes preguntas:

    - ¿Qué país consiguió más de 200 medallas de oro?

    - ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

    - ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

    - Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [23]:
# Extraemos información del dataframe estableciendo condiciones: 
# Podemos hacerlo de dos formas, esta nos saca solo la columna oro 
df_medallas.loc[df_medallas['Oro'] > 200, 'Oro']

0    1473
1    1032
2     745
Name: Oro, dtype: int64

In [30]:
# Otra forma será sacando todas las columnas: 
print('Los países que tienen mas de 200 medallas son:')
condicion_oro = df_medallas.loc[df_medallas['Oro'] > 200, 'País']
condicion_oro

Los países que tienen mas de 200 medallas son:

0            China
1            Japón
2    Corea del Sur
Name: País, dtype: object

In [29]:
# Extraemos los países que tengan más de 200 medallas de oro y más de 1000 de plata:
# Sacando solo las columnas de oro y plata del país 1 (Japón)
version_1 = df_medallas.loc[(df_medallas.Oro > 200) & (df_medallas.Plata > 1000), 'País']
version_1

1    Japón
Name: País, dtype: object

In [32]:
# Extraemos países que cumplan una de las dos condiciones establecidas: > 200 medallas oro o > 700 de bronce
df_medallas.loc[(df_medallas.Oro > 200) | (df_medallas.Bronce > 700), 'País']

0            China
1            Japón
2    Corea del Sur
Name: País, dtype: object

In [35]:
# Creamos una nueva columna con asignación directa que es  'total' que será la suma de las columnas oro, plata y bronce. 
nueva_columna = df_medallas['total'] = df_medallas['Oro'] + df_medallas['Plata'] + df_medallas['Bronce']
nueva_columna

0    3187
1    3054
2    2235
3     557
4     537
5     671
6     585
7     483
8     519
9     446
dtype: int64

In [36]:
# Visualizamos el data frame con la nueva columna
df_medallas

   Unnamed: 0             País   Oro  Plata  Bronce  total
0           1            China  1473    994     720   3187
1           2            Japón  1032   1037     985   3054
2           3    Corea del Sur   745    663     827   2235
3           4             Irán   179    181     197    557
4           5       Kazajistán   155    158     224    537
5           6            India   154    202     315    671
6           7        Tailandia   132    175     278    585
7           8        Indonesia   112    131     240    483
8           9     China Taipéi    99    144     276    519
9          10  Corea del Norte    91    120     235    446